In [45]:
# !pip install mysql-connector-python

In [46]:
# !pip install --upgrade pip

In [1]:
import mysql.connector
import warnings
warnings.filterwarnings("error")

In [2]:
# checking the connection 

mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  password="krsnamysql@2761"
)

# print(mydb.connection_id)

In [3]:
mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  password="krsnamysql@2761",
  database="mypythondb"
)

In [4]:
# creating a table using python 
# A cursor is used to interact with the database and execute SQL queries.
#execute() method is used to execute the  query

mycursor = mydb.cursor()
# mycursor.execute("CREATE DATABASE mypythondb")

In [51]:
mycursor.execute("SHOW DATABASES")
for i in mycursor:
    print(i)

('advancesql',)
('bank_sys',)
('cheatsheet',)
('college',)
('college1',)
('college2',)
('computer',)
('db_test2',)
('emp',)
('goverment',)
('hranalystics',)
('information_schema',)
('music',)
('mypythondb',)
('mysql',)
('performance_schema',)
('practise',)
('projects_hr',)
('pune',)
('sqlinterviewquery',)
('sys',)
('velocity',)
('w3school',)
('walmartsale',)

In [52]:
# mycursor.execute("CREATE TABLE CUSTOMERS (name VARCHAR(30),address VARCHAR(200))")

In [53]:
# to show tables
mycursor = mydb.cursor()
mycursor.execute("SHOW TABLES")

In [54]:
for i in mycursor:
    print(i)

('customers',)

In [55]:
#primary key
#mycursor.execute("CREATE TABLE customers (id INT AUTO_INCREMENT PRIMARY KEY, name VARCHAR(255), address VARCHAR(255))")

# alter table

mycursor.execute("ALTER TABLE customers ADD COLUMN id int AUTO_INCREMENT PRIMARY KEY")

ProgrammingError: 1060 (42S21): Duplicate column name 'id'

## Insert

In [58]:
# insert into tables
# %s -  is used to store all type of values
# rowcount - it represents the number of affected rows - used everywhere
# commit() =  Commit the changes


mycursor = mydb.cursor()
sql = "INSERT INTO CUSTOMERS (name,address,id) VALUES(%s, %s, %s)"
value = ("krushna","padhegaon 413721",101)
mycursor.execute(sql,value)
mydb.commit()

print(mycursor.rowcount,"record inserted")

1 record inserted

In [60]:
sql = "INSERT INTO CUSTOMERS (id,name,address) VALUES(%s, %s, %s)"
value = (102,"krushna","padhegaon 413721")
mycursor.execute(sql,value)
mydb.commit()

In [61]:
print(mycursor.rowcount,"record insert")

1 record insert

In [63]:
sql = "INSERT INTO customers (id,name, address) VALUES (%s, %s, %s)"
val = [
  (103,'Peter', 'Lowstreet 4'),
  (104,'Amy', 'Apple st 652'),
  (105,'Hannah', 'Mountain 21'),
  (106,'Michael', 'Valley 345'),
  (107,'Sandy', 'Ocean blvd 2')
]

mycursor.executemany(sql, val)

mydb.commit()

print(mycursor.rowcount, "was inserted.")

5 was inserted.

## Select

In [5]:
mycursor.execute("SELECT * FROM customers")
myresult = mycursor.fetchall()
for i in myresult:
    print(i)

('krushna', 'padhegaon 413721', 101)
('krushna', 'padhegaon 413721', 102)
('Peter', 'Lowstreet 4', 103)
('Amy', 'Apple st 652', 104)
('Hannah', 'Mountain 21', 105)
('Michael', 'Valley 345', 106)
('Sandy', 'Ocean blvd 2', 107)

In [66]:
mycursor.execute("SELECT name, address FROM customers")
myresult = mycursor.fetchall()
for x in myresult:
  print(x)

('krushna', 'padhegaon 413721')
('krushna', 'padhegaon 413721')
('Peter', 'Lowstreet 4')
('Amy', 'Apple st 652')
('Hannah', 'Mountain 21')
('Michael', 'Valley 345')
('Sandy', 'Ocean blvd 2')

In [67]:
#The fetchone() method will return the first row of the resu
mycursor.execute("SELECT * FROM customers")

myresult = mycursor.fetchone()

print(myresult)

('krushna', 'padhegaon 413721', 101)

## Where

In [11]:

mycursor = mydb.cursor()
sql = "SELECT * FROM customers WHERE address ='Ocean blvd 2'"
mycursor.execute(sql)
myresult = mycursor.fetchall()

In [12]:
for i in myresult:
    print(i)

('Sandy', 'Ocean blvd 2', 107)

## Wildcard Characters

In [ ]:
# select the records that starts, includes, or ends with a given letter or phrase.
# Use the %  to represent wildcard characters:

In [13]:
sql = "SELECT * FROM customers WHERE address LIKE '%gaon%'"
mycursor.execute(sql)
myresult = mycursor.fetchall()
for x in myresult:
  print(x)

('krushna', 'padhegaon 413721', 101)
('krushna', 'padhegaon 413721', 102)

## Order By

In [14]:
sql = "select * from customers order by address"
mycursor.execute(sql)
myresult = mycursor.fetchall()

for x in myresult:
    print(x)

('Amy', 'Apple st 652', 104)
('Peter', 'Lowstreet 4', 103)
('Hannah', 'Mountain 21', 105)
('Sandy', 'Ocean blvd 2', 107)
('krushna', 'padhegaon 413721', 101)
('krushna', 'padhegaon 413721', 102)
('Michael', 'Valley 345', 106)

In [15]:
sql = "select * from customers order by name"
mycursor.execute(sql)
myresult = mycursor.fetchall()

for x in myresult:
    print(x)

('Amy', 'Apple st 652', 104)
('Hannah', 'Mountain 21', 105)
('krushna', 'padhegaon 413721', 101)
('krushna', 'padhegaon 413721', 102)
('Michael', 'Valley 345', 106)
('Peter', 'Lowstreet 4', 103)
('Sandy', 'Ocean blvd 2', 107)

In [16]:
sql = "select * from customers order by address desc"
mycursor.execute(sql)
myresult = mycursor.fetchall()

for x in myresult:
    print(x)

('Michael', 'Valley 345', 106)
('krushna', 'padhegaon 413721', 101)
('krushna', 'padhegaon 413721', 102)
('Sandy', 'Ocean blvd 2', 107)
('Hannah', 'Mountain 21', 105)
('Peter', 'Lowstreet 4', 103)
('Amy', 'Apple st 652', 104)

## Delete

In [17]:

sql = "DELETE FROM customers WHERE address = 'Valley 345'"
mycursor.execute(sql)
mydb.commit()
print(mycursor.rowcount, "record(s) deleted")

1 record(s) deleted

## Drop

In [ ]:
# mycursor = mydb.cursor()
# sql = "DROP TABLE customers"
# mycursor.execute(sql)

In [ ]:
# mycursor = mydb.cursor()

# sql = "DROP TABLE IF EXISTS customers"

# mycursor.execute(sql)

## Update

In [23]:
sql = "UPDATE customers SET address = 'Bankar wasti' WHERE address = 'padhegaon 413721'"

mycursor.execute(sql)

mydb.commit()

print(mycursor, "record(s) affected")

CMySQLCursor: UPDATE customers SET address = 'Bankar w.. record(s) affected

In [25]:
# used limit  to update only one record
sql = "UPDATE customers SET address = 'Padhegaon' WHERE address = 'Bankar wasti' limit 1"

mycursor.execute(sql)

mydb.commit()

print(mycursor, "record(s) affected")

CMySQLCursor: UPDATE customers SET address = 'Padhegao.. record(s) affected

In [26]:
 
mycursor.execute("select * from customers")
myresult = mycursor.fetchall()
print(myresult)

[('krushna', 'Padhegaon', 101), ('krushna', 'Bankar wasti', 102), ('Peter', 'Lowstreet 4', 103), ('Amy', 'Apple st 652', 104), ('Hannah', 'Mountain 21', 105), ('Sandy', 'Ocean blvd 2', 107)]

## Limit - Offset

In [27]:
# offset = without taking starting value 
mycursor.execute("SELECT * FROM customers LIMIT 5 OFFSET 2")

myresult = mycursor.fetchall()

for x in myresult:
  print(x)

('Peter', 'Lowstreet 4', 103)
('Amy', 'Apple st 652', 104)
('Hannah', 'Mountain 21', 105)
('Sandy', 'Ocean blvd 2', 107)

## joins

In [ ]:

sql = "SELECT \
  users.name AS user, \
  products.name AS favorite \
  FROM users \
  INNER JOIN products ON users.fav = products.id"

mycursor.execute(sql)

myresult = mycursor.fetchall()

for x in myresult:
  print(x)